Revit 2026 API

# FilterNumericEquals Properties

---

The FilterNumericEquals type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterNumericRuleEvaluator) |

#### Reference

FilterNumericEquals Class

Autodesk.Revit.DB Namespace